# Merging, Joining and Concatenating

In [1]:
import pandas as pd

In [8]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [6]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

## The pd.concat Method - Part I

In [9]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [10]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [11]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [15]:
len(week1)

250

In [16]:
len(week2)

250

In [18]:
pd.concat([week1, week2])
pd.concat([week1, week2], ignore_index=False) # Maintain the old index of each dataframe
pd.concat([week1, week2], ignore_index=True) # Creat a new Index

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

Alternative method to concatenate

In [20]:
week1.append(week2, ignore_index=True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

## The pd.concat Method - Part II

In [21]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [36]:
sales = pd.concat(objs=[week1,week2], keys = ["Week 1", "Week 2"]) # MultIndex dataframe
sales.head(3)

          Customer ID  Food ID
Week 1 0          537        9
       1           97        4
       2          658        1

In [35]:
sales.loc[("Week 1",)]
sales.loc[("Week 2",)]

sales.loc[("Week 1", 240)]
sales.loc[("Week 2", 129)]

sales.loc[("Week 1", 240), "Customer ID"]
sales.loc[("Week 1", 240), ["Customer ID", "Food ID"]]

Customer ID    945
Food ID          5
Name: (Week 1, 240), dtype: int64

## Inner Joins - Part I

In [39]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [40]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [41]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [44]:
week1.merge(week2, how="inner", on="Customer ID").head(4)

   Customer ID  Food ID_x  Food ID_y
0          537          9          5
1          155          9          3
2          155          1          3
3          503          5          8

Same Customer, two different weeks

In [45]:
week1[week1["Customer ID"] == 155]

    Customer ID  Food ID
4           155        9
17          155        1

In [46]:
week2[week2["Customer ID"] == 155]

     Customer ID  Food ID
208          155        3

In [48]:
week1.merge(week2, how="inner", on="Customer ID", suffixes= [" - Week 1", " - Week 2"]).head(4)

   Customer ID  Food ID - Week 1  Food ID - Week 2
0          537                 9                 5
1          155                 9                 3
2          155                 1                 3
3          503                 5                 8

## Inner Joins - Part II

In [49]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

Same customer, ordering the same food on the two weeks

In [52]:
week1.merge(week2, how="inner", on= ["Customer ID", "Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [53]:
week1[week1["Customer ID"] == 21]

     Customer ID  Food ID
101           21        4
212           21        4

In [54]:
week2[week2["Customer ID"] == 21]

    Customer ID  Food ID
30           21        4

## Outer Joins

In [ ]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

## Left Joins

In [ ]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

## The left_on and right_on Parameters

In [ ]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

## The join() Method

In [ ]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

## The pd.merge() Method

In [ ]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")